<?php
//------------------------------------------------------------------------------
//	カスタムルート定義
//------------------------------------------------------------------------------
$g_routes =
[
//	['/a/b/:c', "top", "index", ["c"=>"/^[a-z]+$/"]],

	//	エラー
	['/error', "error", "index"],
	['/error/access', "error", "access"],
	['/error/notfound', "error", "notfound"],
	['/error/noscript', "error", "noscript"],
	['/error/connect', "error", "connect"],

	//	5段階くらいまでは耐えるようにしておく
	['/:arg1/:arg2/:arg3/:arg4', "top", "index"],
	['/:arg1/:arg2/:arg3', "top", "index"],
	['/:arg1/:arg2', "top", "index"],
	['/:arg1', "top", "index"],
	['/', "top", "index"],
];

//------------------------------------------------------------------------------
//	CSRFを無視するモジュール/アクションのリスト
//------------------------------------------------------------------------------
$g_csrf_ignores =
[
	//	["モジュール名", "アクション名"],
	//	["モジュール名", "*"], ← "*" で全アクションを無視
	//	["*", "*"], ← 両方とも "*" で全モジュールの全アクションを無視
	//	....
];
?>
