/*

	コンポーネント : init

	crow デフォルトのファイル群のうち、
	サンプルに当たるファイルや不要なファイルを削除するためのコンポーネント

*/

//------------------------------------------------------------------------------
//	コンポーネントコンフィグへの追加/上書き
//------------------------------------------------------------------------------
function config()
{
	return
	[
/*
		"key1" => "value1",
		"key2" => "value2",
		"key3" => "true",
*/
	];
}

//------------------------------------------------------------------------------
//	初期化、正常の場合は true を返却し、異常の場合は文字列を返却すること
//------------------------------------------------------------------------------
function init()
{
/*
	//	必須コンポーネントのチェック
	if( comps(['init']) === false )
		return 'required component not applied';

	//	必須コンフィグのチェック
	if( conf('key1', false) === false )
		return 'required config not defined : key1';
*/

	//	正常
	return true;
}

//------------------------------------------------------------------------------
//	適用を無視するファイルを返却
//------------------------------------------------------------------------------
function ignores()
{
/*
	$ignores =
	[
		"[front]/!favicon.ico",
	];

	if( conf('key1') == "value1" )
		$ignores[] = "app/classes/front/module_front_test.php";

	return $ignores;
*/
	return [];
}
