/*

	SPA ルート

*/
//------------------------------------------------------------------------------
//	properties
//------------------------------------------------------------------------------
<props>
{
}
</props>

//------------------------------------------------------------------------------
//	html part
//------------------------------------------------------------------------------
<template>
 <div class="body_wrap" ref="body_wrap">
  <main>
   [[scenes]]
  </main>
  [[footer]]
 </div>
</template>

//------------------------------------------------------------------------------
//	style
//------------------------------------------------------------------------------
<style>
.body_wrap
{
	height: 100%;
	display: flex;
	flex-direction: column;

	main
	{
		flex-grow: 1;
	}

	&.header_show
	{
		padding-top : 56px;
	}
}
</style>

//------------------------------------------------------------------------------
//	init
//------------------------------------------------------------------------------
<init>
{
	//	dbcの初期化
	dbc.set_autosave("lang").read_storage_all();
}
</init>

//------------------------------------------------------------------------------
//	ready
//------------------------------------------------------------------------------
<ready>
{
	//	シーンビルドを行う
	self.build_scene();
}
</ready>

//------------------------------------------------------------------------------
//	watch
//------------------------------------------------------------------------------
<watch>
{
}
</watch>

//------------------------------------------------------------------------------
//	method
//------------------------------------------------------------------------------
<method>
{
	//	シーンビルド
	build_scene()
	{
		//	シーン管理の初期化とページディスパッチ
		(g.scenes = self.pref('scenes')).dispatch
		(
			g.access_path,
			{
				"/" : function(args_)
				{
					g.scenes.push("scene_top", args_);
				},
				"/next" : function(args_)
				{
					g.scenes.push("scene_next", args_);
				},
			},

			//	ルートがマッチしなければNotFoundへ。
			function()
			{
				g.scenes.push("scene_notfound");
			}
		);
	}
}
</method>

//------------------------------------------------------------------------------
//	recv
//------------------------------------------------------------------------------
<recv>
{
	//	エラーハンドラ
	//	paramasは、[code:コード, data:データ, callback:closeコールバック(null可)] を指定する
	error(sender_, params_)
	{
		ui.dialog.popup_error("error", params_[0], params_[1]);
		return true;
	},

	//	メッセージハンドラ
	//	paramasは、[data:データ, callback:closeコールバック(null可)] を指定する
	message(sender_, params_)
	{
		ui.dialog.popup_message("message", params_[0], params_[1]);
		return true;
	}
}
</recv>
