//------------------------------------------------------------------------------
//	コンポーネントコンフィグ
//------------------------------------------------------------------------------
function config()
{
	return
	[
/*
		"test.conf1" => "val1",
		"test.conf2" => "val2",
		"test.conf3" => true,
*/
	];
}

//------------------------------------------------------------------------------
//	適用するコンポーネントを順番通りに返却する
//------------------------------------------------------------------------------
function components()
{
	return
	[
/*
		"init",
		"app",
		"auth_cognito",
*/
	];
}

//------------------------------------------------------------------------------
//	ロールごとにindex.phpの物理パスを返却する
//	終端はパスデリミタとする
//	ここで指定したディレクトリはバックアップ対象となり、コンポーネント再構築の際に一旦復元される。
//	componentにあまり依存しない、大量のファイルや容量を含むディレクトリがある場合は
//	処理負荷を下げるためにバックアップ対象外として、ignores に指定するとよい。
//------------------------------------------------------------------------------
function realpaths()
{
	return
	[
/*
		"front" =>
		[
			"path" => "C:\\laragon\\www\\xxx\\",
			"ignores" =>
			[
				"C:\\laragon\\www\\xxx\\aws_sdk\\",
				"C:\\laragon\\www\\xxx\\imgs\\",
			]
		],
		"admin" => "C:\\laragon\\www\\xxx\\admin\\",
		"crowmin" => "C:\\laragon\\www\\xxx\\crowmin\\",
*/
	];
}
