/*

	workforce row

*/
//------------------------------------------------------------------------------
//	properties
//------------------------------------------------------------------------------
<props>
{
	row : null,

	//	projectのenumを保持
	only_japan : <?= model_project::nat_only_japan ?>,
	only_foreign : <?= model_project::nat_only_foreign ?>,
}
</props>

//------------------------------------------------------------------------------
//	html part
//------------------------------------------------------------------------------
<template>
 <tr class="row border" ref="row">
  <td class="min">{{ row.created_at ? row.created_at : '-' }}</td>
  <td class="min">{{ row.nationality == only_japan ? '日' : row.nationality == only_foreign ? '外' : '両' }}</td>
  <td class="min">{{ row.depth == limit_direct ? '直' : 'P' }}</td>
  <td class="min">{{ row.min_budget ? row.min_budget : '-' }}</td>
  <td class="min">{{ row.max_age ? row.max_age : '-' }}</td>
  <td class="min">{{ row.station ? row.station : '-' }}</td>
  <td class="min">{{ row.status ? row.status : '-' }}</td>
  <td>{{ row.name ? row.name : '-' }}</td>
 </tr>
</template>

//------------------------------------------------------------------------------
//	style
//------------------------------------------------------------------------------
<style>

</style>

//------------------------------------------------------------------------------
//	init
//------------------------------------------------------------------------------
<init>
{
	//	バインド
	let props = self.props();
	dbc.bind("projects", props.todo_id, self, "row");
}
</init>

//------------------------------------------------------------------------------
//	ready
//------------------------------------------------------------------------------
<ready>
{

}
</ready>

//------------------------------------------------------------------------------
//	watch
//------------------------------------------------------------------------------
<watch>
{
}
</watch>

//------------------------------------------------------------------------------
//	method
//------------------------------------------------------------------------------
<method>
{
	//	復元パス取得
	scene_path()
	{

	},

	//	タイトル取得
	scene_title()
	{
		return 'Todo';
	},

	//	休止時
	scene_suspend()
	{
	},

	//	再開時
	scene_resume()
	{
	},

	//	破棄時
	scene_destroy()
	{
	},

	//	案件一覧取得
	get_project_rows_with_ajax()
	{
		ajax.post
		(
			g.project_actions.ajax_get_rows,
		)
	}
}
</method>

//------------------------------------------------------------------------------
//	recv
//------------------------------------------------------------------------------
<recv>
{
}
</recv>
