<?php
/*

	DBセレクト結果セット

*/
class crow_db_result
{
	//--------------------------------------------------------------------------
	//	結果はエラーだったか？
	//--------------------------------------------------------------------------
	public function is_error()
	{
		return( $this->m_errno != 0 );
	}

	//--------------------------------------------------------------------------
	//	結果コード取得
	//--------------------------------------------------------------------------
	public function get_error_code()
	{
		return $this->m_errno;
	}

	//--------------------------------------------------------------------------
	//	結果取得
	//--------------------------------------------------------------------------
	public function get_error()
	{
		return $this->m_error;
	}

	//--------------------------------------------------------------------------
	//	件数取得
	//--------------------------------------------------------------------------
	public function num_rows()
	{
		if( ! $this->m_rset ) return 0;
		return crow::get_hdb_reader()->num_rows($this->m_rset);
	}

	//--------------------------------------------------------------------------
	//	列数取得
	//--------------------------------------------------------------------------
	public function num_cols()
	{
		if( ! $this->m_rset ) return 0;
		return crow::get_hdb_reader()->num_cols($this->m_rset);
	}

	//--------------------------------------------------------------------------
	//	クエリ結果から１行取得
	//
	//	html_escape_をtrueにすると文字列がHTMLエスケープされる。
	//--------------------------------------------------------------------------
	public function get_row( $html_escape_ = false )
	{
		if( ! $this->m_rset ) return false;
		return crow::get_hdb_reader()->get_row($this->m_rset, $html_escape_);
	}

	//--------------------------------------------------------------------------
	//	クエリ結果から全行取得
	//
	//	html_escape_をtrueにすると文字列がHTMLエスケープされる。
	//--------------------------------------------------------------------------
	public function get_rows( $html_escape_ = false )
	{
		if( ! $this->m_rset ) return [];
		return crow::get_hdb_reader()->get_rows($this->m_rset, $html_escape_);
	}



	//--------------------------------------------------------------------------
	//	初期化
	//--------------------------------------------------------------------------
	public function result_set( $rset_=false, $errno_=0, $error_="" )
	{
		$this->m_rset = $rset_;
		$this->m_errno = $errno_;
		$this->m_error = $error_;
	}
	private $m_rset = false;
	private $m_errno = 0;
	private $m_error = "";
}
?>
